post/Programing/bash_note.org
#+TITLE: Bash语法笔记
#+DESCRIPTION: 不是教程，确信
#+DATE: <2026-01-24 六 16:07>
#+SETUPFILE: ../../setup.setup

* 变量
bash的变量是弱类型的还请注意

- 定义： =name="var"=
- 类型：字符串(一切的基础)、整数(从字符串转换来)、数组
  #+begin_src bash
  string="这是字符串"
  arrary=(1 2 3 4 5)  # 数组,内部可为字符串或数字
  #+end_src
- 引用： =$name= 或者 =${name}=
  #+begin_src
  echo $string
  echo ${string}
  echo "${string}"  # 引号能够保留变量内的'\n'换行符，否则可能内容都会挤成一行
  #+end_src
  下面是其他特殊引用
  - 数组全部内容（空格拼接）： =${name[@]}= ，将 =@= 换成数字就是下标
  - 变量长度： =${#name}= ，返回字符串长度，获取数组长度需要使用 =${#name[@]}=
  - 匹配裁切： 其中 =pat= 支持通配符
    - =${name#pat}= 移除以pat开头的部分（最小匹配），将 =#= 换成 =##= 可变成贪婪匹配
    - =${name%pat}= 移除以pat结束的部分（最小匹配），将 =%= 换成 =%%= 可变成贪婪匹配
    若对数组进行这种操作(=${name[@]...}=)就会对每个元素都作处理
  - 匹配替换：
    - =${name/pat/rep}= 将第一个pat替换为rep
    - =${name//pat/rep}= 将所有pat替换为rep(不与下面#或%兼容)
    - =${name/#pat/rep}= 仅匹配以pat开头的
    - =${name/%pat/rep}= 仅匹配以pat结尾的
  - 中间变量： =${!name}= 会返回以 =$name= 的值为名的变量的值
  - 数组索引或键名： =${!name[@]}=
  - 大小写转换：
    - =${name^}= 首字母转大写， =${name^^}= 全部转大写
    - =${name,}= 首字母转小写， =${name,,}= 全部转小写
  - 字符串切片： =${name:start:end}= ，其中start和end都是数字，start或end可以留空。\\
    不是对数组的操作，使用 =${name[@]:1:2}= 只会对拼接结束后的字符串进行切片操作
  - 变量默认值：
    - =${var:-word}= 在var不存在或为空时返回word
    - 使用 =${var:=word}= 能在var为空时自动为var赋值word
    - =${var:+word}= 在var不存在或为空时返回空否则返回word(走与 =-= 相反的逻辑)
    - =${var:?word}= 在var不存在或为空时打印word并退出(原语句不执行)
    - =${var-word}= 类似 =:-= 但仅在var未设置时返回word，其他同理以此类推
  - 转义字符串： =$''= 能以c语言风格转义存储字符串
- 特殊变量：
  - 位置参数： =$0= =$1= =$2= ...
  - 所有参数： =$*= =$@=
  - 参数数量： =$#=
  - 上条命令的退出状态： =$?=
  - 当前进程PID： =$$=
  - 最后的后台进程PID： =$!=
- 操作
  - 数字相加：使用 =$((a+b))= ，其中变量前可不加 =$=

* 语句嵌套
- 获得stdout内容：使用 =`...`= 或者 =$(...)= 获得命令的终端输出结果
- =()= 将命令放在子shell执行（cd等不影响主shell）
- 进程替换：将被包裹的命令的stdin或stdout包装成文件(非POSIX标准功能)
  - =xxx > >(yyy)= 将xxx的结果作为yyy的stdin
  - =xxx < <(yyy)= 将yyy的结果作为xxx的stdin
  - =cat <(xyz)= 将xyz的输出作为文件让cat打开查看
  实际上使用 =echo <(ls)= 可以发现传入的文件名是 =/proc/../fd/..=

#+begin_quote
关于重定向：
- =>= 覆盖写入, =>>= 追加写入
- =<= 文件作stdin, =<(...)= 进程替换, =<<EOF= 字面量多行文字作参数方法（Here Document）
- =<<<= 将shell变量作为stdin
#+end_quote

* 条件表达式
** 语法
判断：在 =[ ... ]= 或 =[[ ... ]]= 内使用 =var1 == var= ，例如
#+begin_src bash
# 判断方法1 直接查看命令返回状态
[[ 114 == 114 ]] ; echo "$?"  # 结果为0即为true, 1为false
# 判断方法2 使用 && 和 || 逻辑操作符
[[ 514 != 514 ]] && echo "true" || echo "false"
# 判断方法3 使用 if语句
if [[ 114 == 1145 ]]; then
    echo "true"
else
    echo "fi"
fi
#+end_src

以下为实际终端输出：
#+begin_src mono-text
~ $ if [ "114" == 514 ];then echo "true";else echo "false";fi
false
~ $ if [ "114" != 514 ];then echo "true";else echo "false";fi
true
~ $ if [[ "114" == 514 ]];then echo "true";else echo "false";fi
false
~ $ if [[ "114" != 514 ]];then echo "true";else echo "false";fi
true
~ $ if [ "114" > 514 ];then echo "true";else echo "false";fi
true
~ $ if [ 114 > 514 ];then echo "true";else echo "false";fi
true
~ $ if [[ "114" > 514 ]];then echo "true";else echo "false";fi
false
~ $ if [[ "114" < 514 ]];then echo "true";else echo "false";fi
true
~ $
#+end_src

#+begin_src mono-text
# 特别指出，对于：
# `[[ a == b ]]` 或 `[ a == b ]`
#    ^ ^  ^ ^         ^ ^  ^ ^
# 使用`^`标记出的空格均不能移除，否则可能会导致问题
# 不是很推荐使用 `[]` 支持的表达式比较少，
# 另外也是因为 `[  ]` 是命令而非关键字
#+end_src
** 条件
在 =[ ... ]= 或 =[[ ... ]]= 内，应使用以下运算符替代 =>= =<= 等字符串比较运算符
- =-eq= 等于
- =-ne= 不等于
- =-lt= 小于， =-le= 小等于
- =-gt= 大于， =-ge= 大等于
其他操作条件：
- =-f= 文件是否存在
- =-d= 是否是文件夹
- ==~= 正则匹配
